Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */
/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_wr.c
 *    Mcxnex Work Request Processing Routines
 *
 *    Implements all the routines necessary to provide the PostSend(),
 *    PostRecv() and PostSRQ() verbs.  Also contains all the code
 *    necessary to implement the Mcxnex WRID tracking mechanism.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/avl.h>
#include <sys/strsun.h>

#include "mcxnex.h"
#include <sys/ib/ib_pkt_hdrs.h>

static uint32_t mcxnex_wr_get_immediate(ibt_send_wr_t *wr);
static int mcxnex_wr_bind_check(mcxnex_state_t *state, ibt_send_wr_t *wr);
static int mcxnex_wqe_send_build(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint64_t *desc, uint_t *size);
static int mcxnex_wqe_mlx_build(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint64_t *desc, uint_t *size);
static void mcxnex_wqe_headroom(uint_t from, mcxnex_qphdl_t qp);
static int mcxnex_wqe_recv_build(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_recv_wr_t *wr, uint64_t *desc);
static int mcxnex_wqe_srq_build(mcxnex_state_t *state, mcxnex_srqhdl_t srq,
    ibt_recv_wr_t *wr, uint64_t *desc);
static void mcxnex_wqe_sync(void *hdl, uint_t sync_from,
    uint_t sync_to, uint_t sync_type, uint_t flag);
static mcxnex_workq_avl_t *mcxnex_wrid_wqavl_find(mcxnex_cqhdl_t cq, uint_t qpn,
    uint_t send_or_recv);
static void mcxnex_cq_workq_add(mcxnex_cqhdl_t cq, mcxnex_workq_avl_t *wqavl);
static void mcxnex_cq_workq_remove(mcxnex_cqhdl_t cq,
    mcxnex_workq_avl_t *wqavl);

static	ibt_wr_ds_t	null_sgl = { 0, 0x00000100, 0 };

static int
mcxnex_post_send_ud(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	mcxnex_hw_snd_wqe_ud_t		*ud;
	mcxnex_workq_hdr_t		*wq;
	mcxnex_ahhdl_t			ah;
	ibt_ud_dest_t			*dest;
	uint64_t			*desc;
	uint32_t			desc_sz;
	uint32_t			signaled_dbd, solicited;
	uint32_t			head, tail, next_tail, qsize_msk;
	uint32_t			hdrmwqes;
	uint32_t			nopcode, fence, immed_data = 0;
	mcxnex_hw_wqe_sgl_t		*ds, *old_ds;
	ibt_wr_ds_t			*sgl;
	uint32_t			nds, dnds;
	int				i, j, last_ds, num_ds, status;
	uint32_t			*wqe_start;
	int				sectperwqe;
	uint_t				posted_cnt = 0;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test_num);

	ASSERT(MUTEX_HELD(&qp->qp_sq_lock));
	_NOTE(LOCK_RELEASED_AS_SIDE_EFFECT(&qp->qp_sq_lock))

	/* Grab the lock for the WRID list */
	membar_consumer();

	/* Save away some initial QP state */
	wq = qp->qp_sq_wqhdr;
	qsize_msk = wq->wq_mask;
	hdrmwqes  = qp->qp_sq_hdrmwqes;		/* in WQEs  */
	sectperwqe = 1 << (qp->qp_sq_log_wqesz - 2);

	tail	  = wq->wq_tail;
	head	  = wq->wq_head;
	status	  = DDI_SUCCESS;

post_next:
	/*
	 * Check for "queue full" condition.  If the queue
	 * is already full, then no more WQEs can be posted.
	 * So break out, ring a doorbell (if necessary) and
	 * return an error
	 */
	if (wq->wq_full != 0) {
		status = IBT_QP_FULL;
		goto done;
	}

	next_tail = (tail + 1) & qsize_msk;
	if (((tail + hdrmwqes) & qsize_msk) == head) {
		wq->wq_full = 1;
	}

	desc = MCXNEX_QP_SQ_ENTRY(qp, tail);

	ud = (mcxnex_hw_snd_wqe_ud_t *)((uintptr_t)desc +
	    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
	ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)ud +
	    sizeof (mcxnex_hw_snd_wqe_ud_t));
	nds = wr->wr_nds;
	sgl = wr->wr_sgl;
	num_ds = 0;

	/* need to know the count of destination nds for backward loop */
	for (dnds = 0, i = 0; i < nds; i++) {
		if (sgl[i].ds_len != 0)
			dnds++;
	}

	/*
	 * Build a Send or Send_LSO WQE
	 */
	if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
		int total_len;

		nopcode = MCXNEX_WQE_SEND_NOPCODE_LSO;
		if (wr->wr.ud_lso.lso_hdr_sz > 60) {
			nopcode |= (1 << 6);	/* ReRead bit must be set */
		}
		dest = wr->wr.ud_lso.lso_ud_dest;
		ah = (mcxnex_ahhdl_t)dest->ud_ah;
		if (ah == NULL) {
			status = IBT_AH_HDL_INVALID;
			goto done;
		}
		MCXNEX_WQE_BUILD_UD(qp, ud, ah, dest);

		total_len = (4 + 0xf + wr->wr.ud_lso.lso_hdr_sz) & ~0xf;
		if ((uintptr_t)ds + total_len + (nds * 16) >
		    (uintptr_t)desc + (1 << qp->qp_sq_log_wqesz)) {
			status = IBT_QP_SGL_LEN_INVALID;
			goto done;
		}
		old_ds = ds;
		bcopy(wr->wr.ud_lso.lso_hdr, (uint32_t *)old_ds + 1,
		    wr->wr.ud_lso.lso_hdr_sz);
		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)ds + total_len);
		i = 0;
	} else if (wr->wr_opcode == IBT_WRC_SEND) {
		if (wr->wr_flags & IBT_WR_SEND_IMMED) {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_SENDI;
			immed_data = wr->wr.ud.udwr_immed;
		} else {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_SEND;
		}
		dest = wr->wr.ud.udwr_dest;
		ah = (mcxnex_ahhdl_t)dest->ud_ah;
		if (ah == NULL) {
			status = IBT_AH_HDL_INVALID;
			goto done;
		}
		MCXNEX_WQE_BUILD_UD(qp, ud, ah, dest);
		i = 0;
	} else {
		status = IBT_QP_OP_TYPE_INVALID;
		goto done;
	}

	if (nds > qp->qp_sq_sgl) {
		status = IBT_QP_SGL_LEN_INVALID;
		goto done;
	}
	for (last_ds = num_ds, j = i; j < nds; j++) {
		if (sgl[j].ds_len != 0)
			last_ds++;	/* real last ds of wqe to fill */
	}
	desc_sz = ((uintptr_t)&ds[last_ds] - (uintptr_t)desc) >> 0x4;
	for (j = nds; --j >= i; ) {
		if (sgl[j].ds_len == 0) {
			continue;
		}

