Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
		/*
		 * Fill in the Data Segment(s) for the current WQE, using the
		 * information contained in the scatter-gather list of the
		 * work request.
		 */
		last_ds--;
		MCXNEX_WQE_BUILD_DATA_SEG_SEND(&ds[last_ds], &sgl[j]);
	}

	membar_producer();

	if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
		MCXNEX_WQE_BUILD_LSO(qp, old_ds, wr->wr.ud_lso.lso_mss,
		    wr->wr.ud_lso.lso_hdr_sz);
	}

	fence = (wr->wr_flags & IBT_WR_SEND_FENCE) ? 1 : 0;

	signaled_dbd = ((qp->qp_sq_sigtype == MCXNEX_QP_SQ_ALL_SIGNALED) ||
	    (wr->wr_flags & IBT_WR_SEND_SIGNAL)) ? 1 : 0;

	solicited = (wr->wr_flags & IBT_WR_SEND_SOLICIT) ? 1 : 0;

	MCXNEX_WQE_SET_CTRL_SEGMENT(desc, desc_sz, fence, immed_data,
	    solicited, signaled_dbd, wr->wr_flags & IBT_WR_SEND_CKSUM, qp);

	wq->wq_wrid[tail] = wr->wr_id;

	tail = next_tail;

	/* Update some of the state in the QP */
	wq->wq_tail = tail;

	membar_producer();

	/* Now set the ownership bit and opcode (first dword). */
	MCXNEX_SET_SEND_WQE_OWNER(qp, (uint32_t *)desc, nopcode);

	posted_cnt++;
	if (--num_wr > 0) {
		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}

		wr++;
		goto post_next;
	}
done:
	if (posted_cnt != 0) {
		ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

		membar_producer();

		/* the FMA retry loop starts for Mcxnex doorbell register. */
		mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		MCXNEX_UAR_DOORBELL(state, uarhdl,
		    (uint64_t *)(void *)&state->hs_uar->send,
		    (uint64_t)qp->qp_ring);

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}
	}
	if (num_posted != NULL)
		*num_posted = posted_cnt;

	mutex_exit(&qp->qp_sq_lock);

	return (status);

pio_error:
	mutex_exit(&qp->qp_sq_lock);
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	return (DDI_FAILURE);
}

static int
mcxnex_post_send_mlx(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	mcxnex_workq_hdr_t		*wq;
	uint64_t			*desc;
	uint32_t			desc_sz;
	uint32_t			signaled_dbd, solicited;
	uint32_t			head, tail, next_tail, qsize_msk;
	uint32_t			hdrmwqes;
	uint32_t			nopcode, fence, immed_data = 0;
	mcxnex_hw_wqe_sgl_t		*ds, *old_ds;
	ibt_wr_ds_t			*sgl;
	uint32_t			nds, dnds;
	int				i, j, last_ds, num_ds, status;
	uint32_t			*wqe_start;
	int				sectperwqe;
	uint_t				posted_cnt = 0;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test_num);

	ASSERT(MUTEX_HELD(&qp->qp_sq_lock));
	_NOTE(LOCK_RELEASED_AS_SIDE_EFFECT(&qp->qp_sq_lock))

	/* Grab the lock for the WRID list */
	membar_consumer();

	/* Save away some initial QP state */
	wq = qp->qp_sq_wqhdr;
	qsize_msk = wq->wq_mask;
	hdrmwqes  = qp->qp_sq_hdrmwqes;		/* in WQEs  */
	sectperwqe = 1 << (qp->qp_sq_log_wqesz - 2);

	tail	  = wq->wq_tail;
	head	  = wq->wq_head;
	status	  = DDI_SUCCESS;

post_next:
	/*
	 * Check for "queue full" condition.  If the queue
	 * is already full, then no more WQEs can be posted.
	 * So break out, ring a doorbell (if necessary) and
	 * return an error
	 */
	if (wq->wq_full != 0) {
		status = IBT_QP_FULL;
		goto done;
	}

	next_tail = (tail + 1) & qsize_msk;
	if (((tail + hdrmwqes) & qsize_msk) == head) {
		wq->wq_full = 1;
	}

	desc = MCXNEX_QP_SQ_ENTRY(qp, tail);

	ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)desc +
	    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
	nds = wr->wr_nds;
	sgl = wr->wr_sgl;
	num_ds = 0;

	/* need to know the count of destination nds for backward loop */
	for (dnds = 0, i = 0; i < nds; i++) {
		if (sgl[i].ds_len != 0)
			dnds++;
	}

	nopcode = MCXNEX_WQE_SEND_NOPCODE_SEND;

	/*
	 * Build a Send or Send_LSO WQE
	 */
	if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
		int total_len, copy_len, mblen;
		mblk_t *bp;
		uint8_t *pdst;

		nopcode = MCXNEX_WQE_SEND_NOPCODE_LSO;
		/* always post re-read bit for lso */
		nopcode |= (1 << 6);

		total_len = (4 + 0xf + wr->wr.ud_lso.lso_hdr_sz) & ~0xf;
		if ((uintptr_t)ds + total_len + (nds * 16) >
		    (uintptr_t)desc + (1 << qp->qp_sq_log_wqesz)) {
			status = IBT_QP_SGL_LEN_INVALID;
			goto done;
		}

		old_ds = ds;
		pdst = (uint8_t *)old_ds;
		pdst += 4;
		bp = (mblk_t *)(void *)wr->wr.ud_lso.lso_hdr;
		for (copy_len = wr->wr.ud_lso.lso_hdr_sz; copy_len != 0;
		    bp = bp->b_cont) {
			mblen = MBLKL(bp);
			if (copy_len > mblen) {
				bcopy(bp->b_rptr, pdst, mblen);
				copy_len -= mblen;
				pdst += mblen;
			} else {
				bcopy(bp->b_rptr, pdst, copy_len);
				copy_len = 0;
			}
		}

		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)ds + total_len);
	}

	if (nds > qp->qp_sq_sgl) {
		status = IBT_QP_SGL_LEN_INVALID;
		goto done;
	}

	for (last_ds = num_ds, j = 0; j < nds; j++) {
		if (sgl[j].ds_len != 0)
			last_ds++;	/* real last ds of wqe to fill */
	}

	desc_sz = ((uintptr_t)&ds[last_ds] - (uintptr_t)desc) >> 0x4;
	for (j = nds; --j >= 0; ) {
		if (sgl[j].ds_len == 0) {
			continue;
		}

		/*
		 * Fill in the Data Segment(s) for the current WQE, using the
		 * information contained in the scatter-gather list of the
		 * work request.
		 */
		last_ds--;
		MCXNEX_WQE_BUILD_DATA_SEG_SEND(&ds[last_ds], &sgl[j]);
	}

	membar_producer();

	if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
		MCXNEX_WQE_BUILD_LSO(qp, old_ds, wr->wr.ud_lso.lso_mss,
		    wr->wr.ud_lso.lso_hdr_sz);
	}

	fence = (wr->wr_flags & IBT_WR_SEND_FENCE) ? 1 : 0;

	signaled_dbd = ((qp->qp_sq_sigtype == MCXNEX_QP_SQ_ALL_SIGNALED) ||
	    (wr->wr_flags & IBT_WR_SEND_SIGNAL)) ? 1 : 0;

	solicited = (wr->wr_flags & IBT_WR_SEND_SOLICIT) ? 1 : 0;

	MCXNEX_WQE_SET_CTRL_SEGMENT(desc, desc_sz, fence, immed_data,
	    solicited, signaled_dbd, wr->wr_flags & IBT_WR_SEND_CKSUM, qp);

	wq->wq_wrid[tail] = wr->wr_id;

	tail = next_tail;

	/* Update some of the state in the QP */
	wq->wq_tail = tail;

	membar_producer();

	/* Now set the ownership bit and opcode (first dword). */
	MCXNEX_SET_SEND_WQE_OWNER(qp, (uint32_t *)desc, nopcode);

