Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
	posted_cnt++;
	if (--num_wr > 0) {
		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}

		wr++;
		goto post_next;
	}
done:
	if (posted_cnt != 0) {
		ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

		membar_producer();

		/* the FMA retry loop starts for Mcxnex doorbell register. */
		mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		MCXNEX_UAR_DOORBELL(state, uarhdl,
		    (uint64_t *)(void *)&state->hs_uar->send,
		    (uint64_t)qp->qp_ring);

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}
	}
	if (num_posted != NULL)
		*num_posted = posted_cnt;

	mutex_exit(&qp->qp_sq_lock);

	return (status);

pio_error:
	mutex_exit(&qp->qp_sq_lock);
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	return (DDI_FAILURE);
}



static int
mcxnex_post_send_rc(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	uint64_t			*desc;
	mcxnex_workq_hdr_t		*wq;
	uint32_t			desc_sz;
	uint32_t			signaled_dbd, solicited;
	uint32_t			head, tail, next_tail, qsize_msk;
	uint32_t			hdrmwqes;
	int				status;
	uint32_t			nopcode, fence, immed_data = 0;
	mcxnex_hw_snd_wqe_remaddr_t	*rc;
	mcxnex_hw_snd_wqe_atomic_t	*at;
	mcxnex_hw_snd_wqe_bind_t	*bn;
	mcxnex_hw_wqe_sgl_t		*ds;
	ibt_wr_ds_t			*sgl;
	uint32_t			nds;
	int				i, last_ds, num_ds;
	uint32_t			*wqe_start;
	int				sectperwqe;
	uint_t				posted_cnt = 0;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test_num);

	ASSERT(MUTEX_HELD(&qp->qp_sq_lock));
	_NOTE(LOCK_RELEASED_AS_SIDE_EFFECT(&qp->qp_sq_lock))

	/* make sure we see any update of wq_head */
	membar_consumer();

	/* Save away some initial QP state */
	wq = qp->qp_sq_wqhdr;
	qsize_msk = wq->wq_mask;
	hdrmwqes  = qp->qp_sq_hdrmwqes;		/* in WQEs  */
	sectperwqe = 1 << (qp->qp_sq_log_wqesz - 2);

	tail	  = wq->wq_tail;
	head	  = wq->wq_head;
	status	  = DDI_SUCCESS;

post_next:
	/*
	 * Check for "queue full" condition.  If the queue
	 * is already full, then no more WQEs can be posted.
	 * So break out, ring a doorbell (if necessary) and
	 * return an error
	 */
	if (wq->wq_full != 0) {
		status = IBT_QP_FULL;
		goto done;
	}
	next_tail = (tail + 1) & qsize_msk;
	if (((tail + hdrmwqes) & qsize_msk) == head) {
		wq->wq_full = 1;
	}

	desc = MCXNEX_QP_SQ_ENTRY(qp, tail);

	ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)desc +
	    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
	nds = wr->wr_nds;
	sgl = wr->wr_sgl;
	num_ds = 0;

	/*
	 * Validate the operation type.  For RC requests, we allow
	 * "Send", "RDMA Read", "RDMA Write", various "Atomic"
	 * operations, and memory window "Bind"
	 */
	switch (wr->wr_opcode) {
	default:
		status = IBT_QP_OP_TYPE_INVALID;
		goto done;

	case IBT_WRC_SEND:
		if (wr->wr_flags & IBT_WR_SEND_IMMED) {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_SENDI;
			immed_data = wr->wr.rc.rcwr.send_immed;
		} else {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_SEND;
		}
		break;

	/*
	 * If this is an RDMA Read or RDMA Write request, then fill
	 * in the "Remote Address" header fields.
	 */
	case IBT_WRC_RDMAW:
		if (wr->wr_flags & IBT_WR_SEND_IMMED) {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_RDMAWI;
			immed_data = wr->wr.rc.rcwr.rdma.rdma_immed;
		} else {
			nopcode = MCXNEX_WQE_SEND_NOPCODE_RDMAW;
		}
		/* FALLTHROUGH */
	case IBT_WRC_RDMAR:
		if (wr->wr_opcode == IBT_WRC_RDMAR)
			nopcode = MCXNEX_WQE_SEND_NOPCODE_RDMAR;
		rc = (mcxnex_hw_snd_wqe_remaddr_t *)((uintptr_t)desc +
		    sizeof (mcxnex_hw_snd_wqe_ctrl_t));

		/*
		 * Build the Remote Address Segment for the WQE, using
		 * the information from the RC work request.
		 */
		MCXNEX_WQE_BUILD_REMADDR(qp, rc, &wr->wr.rc.rcwr.rdma);

		/* Update "ds" for filling in Data Segments (below) */
		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)rc +
		    sizeof (mcxnex_hw_snd_wqe_remaddr_t));
		break;

	/*
	 * If this is one of the Atomic type operations (i.e
	 * Compare-Swap or Fetch-Add), then fill in both the "Remote
	 * Address" header fields and the "Atomic" header fields.
	 */
	case IBT_WRC_CSWAP:
		nopcode = MCXNEX_WQE_SEND_NOPCODE_ATMCS;
		/* FALLTHROUGH */
	case IBT_WRC_FADD:
		if (wr->wr_opcode == IBT_WRC_FADD)
			nopcode = MCXNEX_WQE_SEND_NOPCODE_ATMFA;
		rc = (mcxnex_hw_snd_wqe_remaddr_t *)((uintptr_t)desc +
		    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
		at = (mcxnex_hw_snd_wqe_atomic_t *)((uintptr_t)rc +
		    sizeof (mcxnex_hw_snd_wqe_remaddr_t));

		/*
		 * Build the Remote Address and Atomic Segments for
		 * the WQE, using the information from the RC Atomic
		 * work request.
		 */
		MCXNEX_WQE_BUILD_RC_ATOMIC_REMADDR(qp, rc, wr);
		MCXNEX_WQE_BUILD_ATOMIC(qp, at, wr->wr.rc.rcwr.atomic);

		/* Update "ds" for filling in Data Segments (below) */
		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)at +
		    sizeof (mcxnex_hw_snd_wqe_atomic_t));

		/*
		 * Update "nds" and "sgl" because Atomic requests have
		 * only a single Data Segment.
		 */
		nds = 1;
		sgl = wr->wr_sgl;
		break;

	/*
	 * If this is memory window Bind operation, then we call the
	 * mcxnex_wr_bind_check() routine to validate the request and
	 * to generate the updated RKey.  If this is successful, then
	 * we fill in the WQE's "Bind" header fields.
	 */
	case IBT_WRC_BIND:
		nopcode = MCXNEX_WQE_SEND_NOPCODE_BIND;
		status = mcxnex_wr_bind_check(state, wr);
		if (status != DDI_SUCCESS)
			goto done;

		bn = (mcxnex_hw_snd_wqe_bind_t *)((uintptr_t)desc +
		    sizeof (mcxnex_hw_snd_wqe_ctrl_t));

		/*
		 * Build the Bind Memory Window Segments for the WQE,
		 * using the information from the RC Bind memory
		 * window work request.
		 */
		MCXNEX_WQE_BUILD_BIND(qp, bn, wr->wr.rc.rcwr.bind);

