Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
		/*
		 * Update the "ds" pointer.  Even though the "bind"
		 * operation requires no SGLs, this is necessary to
		 * facilitate the correct descriptor size calculations
		 * (below).
		 */
		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)bn +
		    sizeof (mcxnex_hw_snd_wqe_bind_t));
		nds = 0;
	}

	/*
	 * Now fill in the Data Segments (SGL) for the Send WQE based
	 * on the values setup above (i.e. "sgl", "nds", and the "ds"
	 * pointer. Start by checking for a valid number of SGL entries
	 */
	if (nds > qp->qp_sq_sgl) {
		status = IBT_QP_SGL_LEN_INVALID;
		goto done;
	}

	for (last_ds = num_ds, i = 0; i < nds; i++) {
		if (sgl[i].ds_len != 0)
			last_ds++;	/* real last ds of wqe to fill */
	}
	desc_sz = ((uintptr_t)&ds[last_ds] - (uintptr_t)desc) >> 0x4;
	for (i = nds; --i >= 0; ) {
		if (sgl[i].ds_len == 0) {
			continue;
		}

		/*
		 * Fill in the Data Segment(s) for the current WQE, using the
		 * information contained in the scatter-gather list of the
		 * work request.
		 */
		last_ds--;
		MCXNEX_WQE_BUILD_DATA_SEG_SEND(&ds[last_ds], &sgl[i]);
	}

	fence = (wr->wr_flags & IBT_WR_SEND_FENCE) ? 1 : 0;

	signaled_dbd = ((qp->qp_sq_sigtype == MCXNEX_QP_SQ_ALL_SIGNALED) ||
	    (wr->wr_flags & IBT_WR_SEND_SIGNAL)) ? 1 : 0;

	solicited = (wr->wr_flags & IBT_WR_SEND_SOLICIT) ? 1 : 0;

	MCXNEX_WQE_SET_CTRL_SEGMENT(desc, desc_sz, fence, immed_data, solicited,
	    signaled_dbd, wr->wr_flags & IBT_WR_SEND_CKSUM, qp);

	wq->wq_wrid[tail] = wr->wr_id;

	tail = next_tail;

	/* Update some of the state in the QP */
	wq->wq_tail = tail;

	membar_producer();

	/* Now set the ownership bit of the first one in the chain. */
	MCXNEX_SET_SEND_WQE_OWNER(qp, (uint32_t *)desc, nopcode);

	posted_cnt++;
	if (--num_wr > 0) {
		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}

		wr++;
		goto post_next;
	}
done:

	if (posted_cnt != 0) {
		ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

		membar_producer();

		/* the FMA retry loop starts for Mcxnex doorbell register. */
		mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		/* Ring the doorbell */
		MCXNEX_UAR_DOORBELL(state, uarhdl,
		    (uint64_t *)(void *)&state->hs_uar->send,
		    (uint64_t)qp->qp_ring);

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test_num);

		/* do the invalidate of the headroom */
		wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp,
		    (tail + hdrmwqes) & qsize_msk);
		for (i = 16; i < sectperwqe; i += 16) {
			wqe_start[i] = 0xFFFFFFFF;
		}
	}
	/*
	 * Update the "num_posted" return value (if necessary).
	 * Then drop the locks and return success.
	 */
	if (num_posted != NULL) {
		*num_posted = posted_cnt;
	}

	mutex_exit(&qp->qp_sq_lock);
	return (status);

pio_error:
	mutex_exit(&qp->qp_sq_lock);
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	return (DDI_FAILURE);
}

/*
 * mcxnex_post_send()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_post_send(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	ibt_send_wr_t 			*curr_wr;
	mcxnex_workq_hdr_t		*wq;
	mcxnex_ahhdl_t			ah;
	uint64_t			*desc, *prev;
	uint32_t			desc_sz;
	uint32_t			signaled_dbd, solicited;
	uint32_t			head, tail, next_tail, qsize_msk;
	uint32_t			sync_from, sync_to;
	uint32_t			hdrmwqes;
	uint_t				currindx, wrindx, numremain;
	uint_t				chainlen;
	uint_t				posted_cnt, maxstat;
	uint_t				total_posted;
	int				status;
	uint32_t			nopcode, fence, immed_data = 0;
	uint32_t			prev_nopcode;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/*
	 * Check for user-mappable QP memory.  Note:  We do not allow kernel
	 * clients to post to QP memory that is accessible directly by the
	 * user.  If the QP memory is user accessible, then return an error.
	 */
	if (qp->qp_is_umap) {
		return (IBT_QP_HDL_INVALID);
	}

	mutex_enter(&qp->qp_lock);

	/*
	 * Check QP state.  Can not post Send requests from the "Reset",
	 * "Init", or "RTR" states
	 */
	if ((qp->qp_state == MCXNEX_QP_RESET) ||
	    (qp->qp_state == MCXNEX_QP_INIT) ||
	    (qp->qp_state == MCXNEX_QP_RTR)) {
		mutex_exit(&qp->qp_lock);
		return (IBT_QP_STATE_INVALID);
	}
	mutex_exit(&qp->qp_lock);
	mutex_enter(&qp->qp_sq_lock);

	if (qp->qp_is_special)
		goto post_many;

	/* Use these optimized functions most of the time */
	if (qp->qp_serv_type == MCXNEX_QP_UD)
		return (mcxnex_post_send_ud(state, qp, wr,
		    num_wr, num_posted));

	if (qp->qp_serv_type == MCXNEX_QP_MLX)
		return (mcxnex_post_send_mlx(state, qp, wr,
		    num_wr, num_posted));

	if (qp->qp_serv_type == MCXNEX_QP_RC)
		return (mcxnex_post_send_rc(state, qp, wr,
		    num_wr, num_posted));

	if (qp->qp_serv_type == MCXNEX_QP_UC)
		goto post_many;

	mutex_exit(&qp->qp_sq_lock);
	return (IBT_QP_SRV_TYPE_INVALID);

post_many:
	/* general loop for non-optimized posting */

	/* Grab the lock for the WRID list */
	membar_consumer();

	/* Save away some initial QP state */
	wq = qp->qp_sq_wqhdr;
	qsize_msk = wq->wq_mask;
	tail	  = wq->wq_tail;
	head	  = wq->wq_head;
	hdrmwqes  = qp->qp_sq_hdrmwqes;		/* in WQEs  */

	/* Initialize posted_cnt */
	posted_cnt = 0;
	total_posted = 0;

	/*
	 * For each ibt_send_wr_t in the wr[] list passed in, parse the
	 * request and build a Send WQE.  NOTE:  Because we are potentially
	 * building a chain of WQEs to post, we want to build them all first,
	 * and set the valid (HW Ownership) bit on all but the first.
	 * However, we do not want to validate the first one until the
	 * entire chain of WQEs has been built.  Then in the final
	 * we set the valid bit in the first, flush if needed, and as a last
	 * step ring the appropriate doorbell.  NOTE: the doorbell ring may
	 * NOT be needed if the HCA is already processing, but the doorbell
	 * ring will be done regardless. NOTE ALSO:  It is possible for
	 * more Work Requests to be posted than the HW will support at one
	 * shot.  If this happens, we need to be able to post and ring
	 * several chains here until the the entire request is complete.
	 * NOTE ALSO:  the term "chain" is used to differentiate it from
	 * Work Request List passed in; and because that's the terminology
	 * from the previous generations of HCA - but the WQEs are not, in fact
	 * chained together for Mcxnex
	 */

	wrindx = 0;
	numremain = num_wr;
	status	  = DDI_SUCCESS;
	while ((wrindx < num_wr) && (status == DDI_SUCCESS)) {
		/*
		 * For the first WQE on a new chain we need "prev" to point
		 * to the current descriptor.
		 */
		prev = MCXNEX_QP_SQ_ENTRY(qp, tail);

