Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
	/*
	 * unlike Tavor & Arbel, tail will maintain the number of the
	 * next (this) WQE to be posted.  Since there is no backward linking
	 * in Mcxnex, we can always just look ahead
	 */
		/*
		 * Before we begin, save the current "tail index" for later
		 * DMA sync
		 */
		/* NOTE: don't need to go back one like arbel/tavor */
		sync_from = tail;

		/*
		 * Break the request up into lists that are less than or
		 * equal to the maximum number of WQEs that can be posted
		 * per doorbell ring - 256 currently
		 */
		chainlen = (numremain > MCXNEX_QP_MAXDESC_PER_DB) ?
		    MCXNEX_QP_MAXDESC_PER_DB : numremain;
		numremain -= chainlen;

		for (currindx = 0; currindx < chainlen; currindx++, wrindx++) {
			/*
			 * Check for "queue full" condition.  If the queue
			 * is already full, then no more WQEs can be posted.
			 * So break out, ring a doorbell (if necessary) and
			 * return an error
			 */
			if (wq->wq_full != 0) {
				status = IBT_QP_FULL;
				break;
			}

			/*
			 * Increment the "tail index". Check for "queue
			 * full" condition incl. headroom.  If we detect that
			 * the current work request is going to fill the work
			 * queue, then we mark this condition and continue.
			 * Don't need >=, because going one-by-one we have to
			 * hit it exactly sooner or later
			 */

			next_tail = (tail + 1) & qsize_msk;
			if (((tail + hdrmwqes) & qsize_msk) == head) {
				wq->wq_full = 1;
			}

			/*
			 * Get the address of the location where the next
			 * Send WQE should be built
			 */
			desc = MCXNEX_QP_SQ_ENTRY(qp, tail);
			/*
			 * Call mcxnex_wqe_send_build() to build the WQE
			 * at the given address.  This routine uses the
			 * information in the ibt_send_wr_t list (wr[]) and
			 * returns the size of the WQE when it returns.
			 */
			status = mcxnex_wqe_send_build(state, qp,
			    &wr[wrindx], desc, &desc_sz);
			if (status != DDI_SUCCESS) {
				break;
			}

			/*
			 * Now, build the Ctrl Segment based on
			 * what was just done
			 */
			curr_wr = &wr[wrindx];

			switch (curr_wr->wr_opcode) {
			case IBT_WRC_RDMAW:
				if (curr_wr->wr_flags & IBT_WR_SEND_IMMED) {
					nopcode =
					    MCXNEX_WQE_SEND_NOPCODE_RDMAWI;
					immed_data =
					    mcxnex_wr_get_immediate(curr_wr);
				} else {
					nopcode = MCXNEX_WQE_SEND_NOPCODE_RDMAW;
				}
				break;

			case IBT_WRC_SEND:
				if (curr_wr->wr_flags & IBT_WR_SEND_IMMED) {
					nopcode = MCXNEX_WQE_SEND_NOPCODE_SENDI;
					immed_data =
					    mcxnex_wr_get_immediate(curr_wr);
				} else {
					nopcode = MCXNEX_WQE_SEND_NOPCODE_SEND;
				}
				break;

			case IBT_WRC_SEND_LSO:
				nopcode = MCXNEX_WQE_SEND_NOPCODE_LSO;
				break;

			case IBT_WRC_RDMAR:
				nopcode = MCXNEX_WQE_SEND_NOPCODE_RDMAR;
				break;

			case IBT_WRC_CSWAP:
				nopcode = MCXNEX_WQE_SEND_NOPCODE_ATMCS;
				break;

			case IBT_WRC_FADD:
				nopcode = MCXNEX_WQE_SEND_NOPCODE_ATMFA;
				break;

			case IBT_WRC_BIND:
				nopcode = MCXNEX_WQE_SEND_NOPCODE_BIND;
				break;
			}

			fence = (curr_wr->wr_flags & IBT_WR_SEND_FENCE) ? 1 : 0;

			/*
			 * now, build up the control segment, leaving the
			 * owner bit as it is
			 */

			if ((qp->qp_sq_sigtype == MCXNEX_QP_SQ_ALL_SIGNALED) ||
			    (curr_wr->wr_flags & IBT_WR_SEND_SIGNAL)) {
				signaled_dbd = 1;
			} else {
				signaled_dbd = 0;
			}
			if (curr_wr->wr_flags & IBT_WR_SEND_SOLICIT)
				solicited = 1;
			else
				solicited = 0;

			if (qp->qp_is_special) {
				/* Ensure correctness, set the ReRead bit */
				nopcode |= (1 << 6);
				ah = (mcxnex_ahhdl_t)
				    curr_wr->wr.ud.udwr_dest->ud_ah;
				mutex_enter(&ah->ah_lock);
				maxstat = ah->ah_udav->max_stat_rate;
				MCXNEX_WQE_SET_MLX_CTRL_SEGMENT(desc, desc_sz,
				    signaled_dbd, maxstat, ah->ah_udav->rlid,
				    qp, ah->ah_udav->sl);
				mutex_exit(&ah->ah_lock);
			} else {
				MCXNEX_WQE_SET_CTRL_SEGMENT(desc, desc_sz,
				    fence, immed_data, solicited,
				    signaled_dbd, curr_wr->wr_flags &
				    IBT_WR_SEND_CKSUM, qp);
			}
			wq->wq_wrid[tail] = curr_wr->wr_id;

			/*
			 * If this is not the first descriptor on the current
			 * chain, then set the ownership bit.
			 */
			if (currindx != 0) {		/* not the first */
				membar_producer();
				MCXNEX_SET_SEND_WQE_OWNER(qp,
				    (uint32_t *)desc, nopcode);
			} else
				prev_nopcode = nopcode;

			/*
			 * Update the current "tail index" and increment
			 * "posted_cnt"
			 */
			tail = next_tail;
			posted_cnt++;
		}

		/*
		 * If we reach here and there are one or more WQEs which have
		 * been successfully built as a chain, we have to finish up
		 * and prepare them for writing to the HW
		 * The steps are:
		 * 	1. do the headroom fixup
		 *	2. add in the size of the headroom for the sync
		 *	3. write the owner bit for the first WQE
		 *	4. sync them
		 *	5. fix up the structures
		 *	6. hit the doorbell in UAR
		 */
		if (posted_cnt != 0) {
			ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

			/*
			 * Save away updated "tail index" for the DMA sync
			 * including the headroom that will be needed
			 */
			sync_to = (tail + hdrmwqes) & qsize_msk;

			/* do the invalidate of the headroom */

			mcxnex_wqe_headroom(tail, qp);

			/* Do a DMA sync for current send WQE(s) */
			mcxnex_wqe_sync(qp, sync_from, sync_to, MCXNEX_WR_SEND,
			    DDI_DMA_SYNC_FORDEV);

			/* Update some of the state in the QP */
			wq->wq_tail = tail;
			total_posted += posted_cnt;
			posted_cnt = 0;

			membar_producer();

			/*
			 * Now set the ownership bit of the first
			 * one in the chain
			 */
			MCXNEX_SET_SEND_WQE_OWNER(qp, (uint32_t *)prev,
			    prev_nopcode);

			/* the FMA retry loop starts for Mcxnex doorbell. */
			mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt,
			    fm_status, fm_test);

			MCXNEX_UAR_DOORBELL(state, uarhdl,
			    (uint64_t *)(void *)&state->hs_uar->send,
			    (uint64_t)qp->qp_ring);

			/* the FMA retry loop ends. */
			mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt,
			    fm_status, fm_test);
		}
	}

	/*
	 * Update the "num_posted" return value (if necessary).
	 * Then drop the locks and return success.
	 */
	if (num_posted != NULL) {
		*num_posted = total_posted;
	}
	mutex_exit(&qp->qp_sq_lock);
	return (status);

pio_error:
	mutex_exit(&qp->qp_sq_lock);
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	return (DDI_FAILURE);
}


