Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
/*
 * mcxnex_post_recv()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_post_recv(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_recv_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	uint64_t			*desc;
	mcxnex_workq_hdr_t		*wq;
	uint32_t			head, tail, next_tail, qsize_msk;
	uint32_t			sync_from, sync_to;
	uint_t				wrindx;
	uint_t				posted_cnt;
	int				status;

	/*
	 * Check for user-mappable QP memory.  Note:  We do not allow kernel
	 * clients to post to QP memory that is accessible directly by the
	 * user.  If the QP memory is user accessible, then return an error.
	 */
	if (qp->qp_is_umap) {
		return (IBT_QP_HDL_INVALID);
	}

	/* Initialize posted_cnt */
	posted_cnt = 0;

	mutex_enter(&qp->qp_lock);

	/*
	 * Check if QP is associated with an SRQ
	 */
	if (qp->qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mutex_exit(&qp->qp_lock);
		return (IBT_SRQ_IN_USE);
	}

	/*
	 * Check QP state.  Can not post Recv requests from the "Reset" state
	 */
	if (qp->qp_state == MCXNEX_QP_RESET) {
		mutex_exit(&qp->qp_lock);
		return (IBT_QP_STATE_INVALID);
	}

	/* Check that work request transport type is valid */
	if ((qp->qp_serv_type != MCXNEX_QP_UD) &&
	    (qp->qp_serv_type != MCXNEX_QP_RC) &&
	    (qp->qp_serv_type != MCXNEX_QP_UC) &&
	    (qp->qp_serv_type != MCXNEX_QP_MLX)) {
		mutex_exit(&qp->qp_lock);
		return (IBT_QP_SRV_TYPE_INVALID);
	}

	mutex_exit(&qp->qp_lock);
	mutex_enter(&qp->qp_rq_lock);

	/*
	 * Grab the lock for the WRID list, i.e., membar_consumer().
	 * This is not needed because the mutex_enter() above has
	 * the same effect.
	 */

	/* Save away some initial QP state */
	wq = qp->qp_rq_wqhdr;
	qsize_msk = wq->wq_mask;
	tail	  = wq->wq_tail;
	head	  = wq->wq_head;

	wrindx = 0;
	status	  = DDI_SUCCESS;
	/*
	 * Before we begin, save the current "tail index" for later
	 * DMA sync
	 */
	sync_from = tail;

	for (wrindx = 0; wrindx < num_wr; wrindx++) {
		if (wq->wq_full != 0) {
			status = IBT_QP_FULL;
			break;
		}
		next_tail = (tail + 1) & qsize_msk;
		if (next_tail == head) {
			wq->wq_full = 1;
		}
		desc = MCXNEX_QP_RQ_ENTRY(qp, tail);
		status = mcxnex_wqe_recv_build(state, qp, &wr[wrindx], desc);
		if (status != DDI_SUCCESS) {
			break;
		}

		wq->wq_wrid[tail] = wr[wrindx].wr_id;
		qp->qp_rq_wqecntr++;

		tail = next_tail;
		posted_cnt++;
	}

	if (posted_cnt != 0) {
		/* Save away updated "tail index" for the DMA sync */
		sync_to = tail;

		mcxnex_wqe_sync(qp, sync_from, sync_to, MCXNEX_WR_RECV,
		    DDI_DMA_SYNC_FORDEV);

		wq->wq_tail = tail;

		membar_producer();	/* ensure wrids are visible */

		/* Update the doorbell record w/ wqecntr */
		MCXNEX_UAR_DB_RECORD_WRITE(qp->qp_rq_vdbr,
		    qp->qp_rq_wqecntr & 0xFFFF);
	}

	if (num_posted != NULL) {
		*num_posted = posted_cnt;
	}


	mutex_exit(&qp->qp_rq_lock);
	return (status);
}

/*
 * mcxnex_post_srq()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_post_srq(mcxnex_state_t *state, mcxnex_srqhdl_t srq,
    ibt_recv_wr_t *wr, uint_t num_wr, uint_t *num_posted)
{
	uint64_t			*desc;
	mcxnex_workq_hdr_t		*wq;
	uint_t				indx, wrindx;
	uint_t				posted_cnt;
	int				status;

	mutex_enter(&srq->srq_lock);

	/*
	 * Check for user-mappable QP memory.  Note:  We do not allow kernel
	 * clients to post to QP memory that is accessible directly by the
	 * user.  If the QP memory is user accessible, then return an error.
	 */
	if (srq->srq_is_umap) {
		mutex_exit(&srq->srq_lock);
		return (IBT_SRQ_HDL_INVALID);
	}

	/*
	 * Check SRQ state.  Can not post Recv requests when SRQ is in error
	 */
	if (srq->srq_state == MCXNEX_SRQ_STATE_ERROR) {
		mutex_exit(&srq->srq_lock);
		return (IBT_QP_STATE_INVALID);
	}

	status = DDI_SUCCESS;
	posted_cnt = 0;
	wq = srq->srq_wq_wqhdr;
	indx = wq->wq_head;

	for (wrindx = 0; wrindx < num_wr; wrindx++) {

		if (indx == wq->wq_tail) {
			status = IBT_QP_FULL;
			break;
		}
		desc = MCXNEX_SRQ_WQE_ADDR(srq, indx);

		wq->wq_wrid[indx] = wr[wrindx].wr_id;

		status = mcxnex_wqe_srq_build(state, srq, &wr[wrindx], desc);
		if (status != DDI_SUCCESS) {
			break;
		}

		mcxnex_wqe_sync(srq, indx, indx + 1,
		    MCXNEX_WR_SRQ, DDI_DMA_SYNC_FORDEV);
		posted_cnt++;
		indx = htons(((uint16_t *)desc)[1]);
		wq->wq_head = indx;
	}

	if (posted_cnt != 0) {

		srq->srq_wq_wqecntr += posted_cnt;

		membar_producer();	/* ensure wrids are visible */

		/* Ring the doorbell w/ wqecntr */
		MCXNEX_UAR_DB_RECORD_WRITE(srq->srq_wq_vdbr,
		    srq->srq_wq_wqecntr & 0xFFFF);
	}

	if (num_posted != NULL) {
		*num_posted = posted_cnt;
	}

	mutex_exit(&srq->srq_lock);
	return (status);
}


/*
 * mcxnex_wqe_send_build()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_wqe_send_build(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_send_wr_t *wr, uint64_t *desc, uint_t *size)
{
	mcxnex_hw_snd_wqe_ud_t		*ud;
	mcxnex_hw_snd_wqe_remaddr_t	*rc;
	mcxnex_hw_snd_wqe_atomic_t	*at;
	mcxnex_hw_snd_wqe_remaddr_t	*uc;
	mcxnex_hw_snd_wqe_bind_t	*bn;
	mcxnex_hw_wqe_sgl_t		*ds, *old_ds;
	ibt_ud_dest_t			*dest;
	ibt_wr_ds_t			*sgl;
	mcxnex_ahhdl_t			ah;
	uint32_t			nds;
	int				i, j, last_ds, num_ds, status;
	int				tmpsize;

	ASSERT(MUTEX_HELD(&qp->qp_sq_lock));

	/* Initialize the information for the Data Segments */
	ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)desc +
	    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
	nds = wr->wr_nds;
	sgl = wr->wr_sgl;
	num_ds = 0;
	i = 0;

	/*
	 * Build a Send WQE depends first and foremost on the transport
	 * type of Work Request (i.e. UD, RC, or UC)
	 */
	switch (wr->wr_trans) {
	case IBT_UD_SRV:
		/* Ensure that work request transport type matches QP type */
		if (qp->qp_serv_type != MCXNEX_QP_UD) {
			return (IBT_QP_SRV_TYPE_INVALID);
		}

		/*
		 * Validate the operation type.  For UD requests, only the
		 * "Send" and "Send LSO" operations are valid.
		 */
		if (wr->wr_opcode != IBT_WRC_SEND &&
		    wr->wr_opcode != IBT_WRC_SEND_LSO) {
			return (IBT_QP_OP_TYPE_INVALID);
		}

		/*
		 * If this is a Special QP (QP0 or QP1), then we need to
		 * build MLX WQEs instead.  So jump to mcxnex_wqe_mlx_build()
		 * and return whatever status it returns
		 */
		if (qp->qp_is_special) {
			if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
				return (IBT_QP_OP_TYPE_INVALID);
			}
			status = mcxnex_wqe_mlx_build(state, qp,
			    wr, desc, size);
			return (status);
		}

