Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
		/*
		 * Otherwise, if this is a normal UD Send request, then fill
		 * all the fields in the Mcxnex UD header for the WQE.  Note:
		 * to do this we'll need to extract some information from the
		 * Address Handle passed with the work request.
		 */
		ud = (mcxnex_hw_snd_wqe_ud_t *)((uintptr_t)desc +
		    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
		if (wr->wr_opcode == IBT_WRC_SEND) {
			dest = wr->wr.ud.udwr_dest;
		} else {
			dest = wr->wr.ud_lso.lso_ud_dest;
		}
		ah = (mcxnex_ahhdl_t)dest->ud_ah;
		if (ah == NULL) {
			return (IBT_AH_HDL_INVALID);
		}

		/*
		 * Build the Unreliable Datagram Segment for the WQE, using
		 * the information from the address handle and the work
		 * request.
		 */
		/* mutex_enter(&ah->ah_lock); */
		if (wr->wr_opcode == IBT_WRC_SEND) {
			MCXNEX_WQE_BUILD_UD(qp, ud, ah, wr->wr.ud.udwr_dest);
		} else {	/* IBT_WRC_SEND_LSO */
			MCXNEX_WQE_BUILD_UD(qp, ud, ah,
			    wr->wr.ud_lso.lso_ud_dest);
		}
		/* mutex_exit(&ah->ah_lock); */

		/* Update "ds" for filling in Data Segments (below) */
		ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)ud +
		    sizeof (mcxnex_hw_snd_wqe_ud_t));

		if (wr->wr_opcode == IBT_WRC_SEND_LSO) {
			int total_len;

			total_len = (4 + 0xf + wr->wr.ud_lso.lso_hdr_sz) & ~0xf;
			if ((uintptr_t)ds + total_len + (nds * 16) >
			    (uintptr_t)desc + (1 << qp->qp_sq_log_wqesz))
				return (IBT_QP_SGL_LEN_INVALID);

			bcopy(wr->wr.ud_lso.lso_hdr, (uint32_t *)ds + 1,
			    wr->wr.ud_lso.lso_hdr_sz);
			old_ds = ds;
			ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)ds + total_len);
			for (; i < nds; i++) {
				if (sgl[i].ds_len == 0)
					continue;
				MCXNEX_WQE_BUILD_DATA_SEG_SEND(&ds[num_ds],
				    &sgl[i]);
				num_ds++;
				i++;
				break;
			}
			membar_producer();
			MCXNEX_WQE_BUILD_LSO(qp, old_ds, wr->wr.ud_lso.lso_mss,
			    wr->wr.ud_lso.lso_hdr_sz);
		}

		break;

	case IBT_RC_SRV:
		/* Ensure that work request transport type matches QP type */
		if (qp->qp_serv_type != MCXNEX_QP_RC) {
			return (IBT_QP_SRV_TYPE_INVALID);
		}

		/*
		 * Validate the operation type.  For RC requests, we allow
		 * "Send", "RDMA Read", "RDMA Write", various "Atomic"
		 * operations, and memory window "Bind"
		 */
		if ((wr->wr_opcode != IBT_WRC_SEND) &&
		    (wr->wr_opcode != IBT_WRC_RDMAR) &&
		    (wr->wr_opcode != IBT_WRC_RDMAW) &&
		    (wr->wr_opcode != IBT_WRC_CSWAP) &&
		    (wr->wr_opcode != IBT_WRC_FADD) &&
		    (wr->wr_opcode != IBT_WRC_BIND)) {
			return (IBT_QP_OP_TYPE_INVALID);
		}

		/*
		 * If this is a Send request, then all we need to do is break
		 * out and here and begin the Data Segment processing below
		 */
		if (wr->wr_opcode == IBT_WRC_SEND) {
			break;
		}

		/*
		 * If this is an RDMA Read or RDMA Write request, then fill
		 * in the "Remote Address" header fields.
		 */
		if ((wr->wr_opcode == IBT_WRC_RDMAR) ||
		    (wr->wr_opcode == IBT_WRC_RDMAW)) {
			rc = (mcxnex_hw_snd_wqe_remaddr_t *)((uintptr_t)desc +
			    sizeof (mcxnex_hw_snd_wqe_ctrl_t));

			/*
			 * Build the Remote Address Segment for the WQE, using
			 * the information from the RC work request.
			 */
			MCXNEX_WQE_BUILD_REMADDR(qp, rc, &wr->wr.rc.rcwr.rdma);

			/* Update "ds" for filling in Data Segments (below) */
			ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)rc +
			    sizeof (mcxnex_hw_snd_wqe_remaddr_t));
			break;
		}

		/*
		 * If this is one of the Atomic type operations (i.e
		 * Compare-Swap or Fetch-Add), then fill in both the "Remote
		 * Address" header fields and the "Atomic" header fields.
		 */
		if ((wr->wr_opcode == IBT_WRC_CSWAP) ||
		    (wr->wr_opcode == IBT_WRC_FADD)) {
			rc = (mcxnex_hw_snd_wqe_remaddr_t *)((uintptr_t)desc +
			    sizeof (mcxnex_hw_snd_wqe_ctrl_t));
			at = (mcxnex_hw_snd_wqe_atomic_t *)((uintptr_t)rc +
			    sizeof (mcxnex_hw_snd_wqe_remaddr_t));

			/*
			 * Build the Remote Address and Atomic Segments for
			 * the WQE, using the information from the RC Atomic
			 * work request.
			 */
			MCXNEX_WQE_BUILD_RC_ATOMIC_REMADDR(qp, rc, wr);
			MCXNEX_WQE_BUILD_ATOMIC(qp, at, wr->wr.rc.rcwr.atomic);

			/* Update "ds" for filling in Data Segments (below) */
			ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)at +
			    sizeof (mcxnex_hw_snd_wqe_atomic_t));

			/*
			 * Update "nds" and "sgl" because Atomic requests have
			 * only a single Data Segment (and they are encoded
			 * somewhat differently in the work request.
			 */
			nds = 1;
			sgl = wr->wr_sgl;
			break;
		}

		/*
		 * If this is memory window Bind operation, then we call the
		 * mcxnex_wr_bind_check() routine to validate the request and
		 * to generate the updated RKey.  If this is successful, then
		 * we fill in the WQE's "Bind" header fields.
		 */
		if (wr->wr_opcode == IBT_WRC_BIND) {
			status = mcxnex_wr_bind_check(state, wr);
			if (status != DDI_SUCCESS) {
				return (status);
			}

			bn = (mcxnex_hw_snd_wqe_bind_t *)((uintptr_t)desc +
			    sizeof (mcxnex_hw_snd_wqe_ctrl_t));

			/*
			 * Build the Bind Memory Window Segments for the WQE,
			 * using the information from the RC Bind memory
			 * window work request.
			 */
			MCXNEX_WQE_BUILD_BIND(qp, bn, wr->wr.rc.rcwr.bind);

			/*
			 * Update the "ds" pointer.  Even though the "bind"
			 * operation requires no SGLs, this is necessary to
			 * facilitate the correct descriptor size calculations
			 * (below).
			 */
			ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)bn +
			    sizeof (mcxnex_hw_snd_wqe_bind_t));
			nds = 0;
		}
		break;

	case IBT_UC_SRV:
		/* Ensure that work request transport type matches QP type */
		if (qp->qp_serv_type != MCXNEX_QP_UC) {
			return (IBT_QP_SRV_TYPE_INVALID);
		}

		/*
		 * Validate the operation type.  For UC requests, we only
		 * allow "Send", "RDMA Write", and memory window "Bind".
		 * Note: Unlike RC, UC does not allow "RDMA Read" or "Atomic"
		 * operations
		 */
		if ((wr->wr_opcode != IBT_WRC_SEND) &&
		    (wr->wr_opcode != IBT_WRC_RDMAW) &&
		    (wr->wr_opcode != IBT_WRC_BIND)) {
			return (IBT_QP_OP_TYPE_INVALID);
		}

		/*
		 * If this is a Send request, then all we need to do is break
		 * out and here and begin the Data Segment processing below
		 */
		if (wr->wr_opcode == IBT_WRC_SEND) {
			break;
		}

