Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
	/* Fill in the Data Segments (SGL) for the Recv WQE */
	ds = (mcxnex_hw_wqe_sgl_t *)((uintptr_t)desc +
	    sizeof (mcxnex_hw_srq_wqe_next_t));
	num_ds = 0;

	/* Check for valid number of SGL entries */
	if (wr->wr_nds > srq->srq_wq_sgl) {
		return (IBT_QP_SGL_LEN_INVALID);
	}

	/*
	 * For each SGL in the Recv Work Request, fill in the Recv WQE's data
	 * segments.  Note: We skip any SGL with zero size because Mcxnex
	 * hardware cannot handle a zero for "byte_cnt" in the WQE.  Actually
	 * the encoding for zero means a 2GB transfer.  Because of this special
	 * encoding in the hardware, we mask the requested length with
	 * MCXNEX_WQE_SGL_BYTE_CNT_MASK (so that 2GB will end up encoded as
	 * zero.)
	 */
	for (i = 0; i < wr->wr_nds; i++) {
		if (wr->wr_sgl[i].ds_len == 0) {
			continue;
		}

		/*
		 * Fill in the Data Segment(s) for the receive WQE, using the
		 * information contained in the scatter-gather list of the
		 * work request.
		 */
		MCXNEX_WQE_BUILD_DATA_SEG_RECV(&ds[num_ds], &wr->wr_sgl[i]);
		num_ds++;
	}

	/*
	 * put in the null sgl pointer as well, if needed
	 */
	if (num_ds < srq->srq_wq_sgl) {
		MCXNEX_WQE_BUILD_DATA_SEG_RECV(&ds[num_ds], &null_sgl);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_wr_get_immediate()
 *    Context: Can be called from interrupt or base context.
 */
static uint32_t
mcxnex_wr_get_immediate(ibt_send_wr_t *wr)
{
	/*
	 * This routine extracts the "immediate data" from the appropriate
	 * location in the IBTF work request.  Because of the way the
	 * work request structure is defined, the location for this data
	 * depends on the actual work request operation type.
	 */

	/* For RDMA Write, test if RC or UC */
	if (wr->wr_opcode == IBT_WRC_RDMAW) {
		if (wr->wr_trans == IBT_RC_SRV) {
			return (wr->wr.rc.rcwr.rdma.rdma_immed);
		} else {  /* IBT_UC_SRV */
			return (wr->wr.uc.ucwr.rdma.rdma_immed);
		}
	}

	/* For Send, test if RC, UD, or UC */
	if (wr->wr_opcode == IBT_WRC_SEND) {
		if (wr->wr_trans == IBT_RC_SRV) {
			return (wr->wr.rc.rcwr.send_immed);
		} else if (wr->wr_trans == IBT_UD_SRV) {
			return (wr->wr.ud.udwr_immed);
		} else {  /* IBT_UC_SRV */
			return (wr->wr.uc.ucwr.send_immed);
		}
	}

	/*
	 * If any other type of request, then immediate is undefined
	 */
	return (0);
}

/*
 * mcxnex_wqe_headroom()
 *	Context: can be called from interrupt or base, currently only from
 *	base context.
 * Routine that fills in the headroom for the Send Queue
 */

static void
mcxnex_wqe_headroom(uint_t from, mcxnex_qphdl_t qp)
{
	uint32_t	*wqe_start, *wqe_top, *wqe_base, qsize;
	int		hdrmwqes, wqesizebytes, sectperwqe;
	uint32_t	invalue;
	int		i, j;

	qsize	 = qp->qp_sq_bufsz;
	wqesizebytes = 1 << qp->qp_sq_log_wqesz;
	sectperwqe = wqesizebytes >> 6; 	/* 64 bytes/section */
	hdrmwqes = qp->qp_sq_hdrmwqes;
	wqe_base  = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp, 0);
	wqe_top	  = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp, qsize);
	wqe_start = (uint32_t *)MCXNEX_QP_SQ_ENTRY(qp, from);

	for (i = 0; i < hdrmwqes; i++)	{
		for (j = 0; j < sectperwqe; j++) {
			if (j == 0) {		/* 1st section of wqe */
				/* perserve ownership bit */
				invalue = ddi_get32(qp->qp_wqinfo.qa_acchdl,
				    wqe_start) | 0x7FFFFFFF;
			} else {
				/* or just invalidate it */
				invalue = 0xFFFFFFFF;
			}
			ddi_put32(qp->qp_wqinfo.qa_acchdl, wqe_start, invalue);
			wqe_start += 16;	/* move 64 bytes */
		}
		if (wqe_start == wqe_top)	/* hit the end of the queue */
			wqe_start = wqe_base;	/* wrap to start */
	}
}

/*
 * mcxnex_wqe_sync()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_wqe_sync(void *hdl, uint_t sync_from, uint_t sync_to,
    uint_t sync_type, uint_t flag)
{
	mcxnex_qphdl_t		qp;
	mcxnex_srqhdl_t		srq;
	uint64_t		*wqe_from, *wqe_to;
	uint64_t		*wq_base, *wq_top, *qp_base;
	ddi_dma_handle_t	dmahdl;
	off_t			offset;
	size_t			length;
	uint32_t		qsize;
	int			status;

	if (sync_type == MCXNEX_WR_SRQ) {
		srq = (mcxnex_srqhdl_t)hdl;
		/* Get the DMA handle from SRQ context */
		dmahdl = srq->srq_mrhdl->mr_bindinfo.bi_dmahdl;
		/* get base addr of the buffer */
		qp_base = (uint64_t *)(void *)srq->srq_wq_buf;
	} else {
		qp = (mcxnex_qphdl_t)hdl;
		/* Get the DMA handle from QP context */
		dmahdl = qp->qp_mrhdl->mr_bindinfo.bi_dmahdl;
		/* Determine the base address of the QP buffer */
		if (qp->qp_sq_baseaddr == 0) {
			qp_base = (uint64_t *)(void *)(qp->qp_sq_buf);
		} else {
			qp_base = (uint64_t *)(void *)(qp->qp_rq_buf);
		}
	}

	/*
	 * Depending on the type of the work queue, we grab information
	 * about the address ranges we need to DMA sync.
	 */

	if (sync_type == MCXNEX_WR_SEND) {
		wqe_from = MCXNEX_QP_SQ_ENTRY(qp, sync_from);
		wqe_to   = MCXNEX_QP_SQ_ENTRY(qp, sync_to);
		qsize	 = qp->qp_sq_bufsz;

		wq_base = MCXNEX_QP_SQ_ENTRY(qp, 0);
		wq_top	 = MCXNEX_QP_SQ_ENTRY(qp, qsize);
	} else if (sync_type == MCXNEX_WR_RECV) {
		wqe_from = MCXNEX_QP_RQ_ENTRY(qp, sync_from);
		wqe_to   = MCXNEX_QP_RQ_ENTRY(qp, sync_to);
		qsize	 = qp->qp_rq_bufsz;

		wq_base = MCXNEX_QP_RQ_ENTRY(qp, 0);
		wq_top	 = MCXNEX_QP_RQ_ENTRY(qp, qsize);
	} else {
		wqe_from = MCXNEX_SRQ_WQ_ENTRY(srq, sync_from);
		wqe_to   = MCXNEX_SRQ_WQ_ENTRY(srq, sync_to);
		qsize	 = srq->srq_wq_bufsz;

		wq_base = MCXNEX_SRQ_WQ_ENTRY(srq, 0);
		wq_top	 = MCXNEX_SRQ_WQ_ENTRY(srq, qsize);
	}

	/*
	 * There are two possible cases for the beginning and end of the WQE
	 * chain we are trying to sync.  Either this is the simple case, where
	 * the end of the chain is below the beginning of the chain, or it is
	 * the "wrap-around" case, where the end of the chain has wrapped over
	 * the end of the queue.  In the former case, we simply need to
	 * calculate the span from beginning to end and sync it.  In the latter
	 * case, however, we need to calculate the span from the top of the
	 * work queue to the end of the chain and sync that, and then we need
	 * to find the other portion (from beginning of chain to end of queue)
	 * and sync that as well.  Note: if the "top to end" span is actually
	 * zero length, then we don't do a DMA sync because a zero length DMA
	 * sync unnecessarily syncs the entire work queue.
	 */
	if (wqe_to > wqe_from) {
		/* "From Beginning to End" */

		offset = (off_t)((uintptr_t)wqe_from - (uintptr_t)qp_base);
		length = (size_t)((uintptr_t)wqe_to - (uintptr_t)wqe_from);

		status = ddi_dma_sync(dmahdl, offset, length, flag);
		if (status != DDI_SUCCESS) {
			return;
		}
	} else {
		/* "From Top to End" */

		offset = (off_t)((uintptr_t)wq_base - (uintptr_t)qp_base);
		length = (size_t)((uintptr_t)wqe_to - (uintptr_t)wq_base);
		if (length) {
			status = ddi_dma_sync(dmahdl, offset, length, flag);
			if (status != DDI_SUCCESS) {
				return;
			}
		}

