Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
		/* "From Beginning to Bottom" */

		offset = (off_t)((uintptr_t)wqe_from - (uintptr_t)qp_base);
		length = (size_t)((uintptr_t)wq_top - (uintptr_t)wqe_from);
		status = ddi_dma_sync(dmahdl, offset, length, flag);
		if (status != DDI_SUCCESS) {
			return;
		}
	}
}


/*
 * mcxnex_wr_bind_check()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_wr_bind_check(mcxnex_state_t *state, ibt_send_wr_t *wr)
{
	ibt_bind_flags_t	bind_flags;
	uint64_t		vaddr, len;
	uint64_t		reg_start_addr, reg_end_addr;
	mcxnex_mwhdl_t		mw;
	mcxnex_mrhdl_t		mr;
	mcxnex_rsrc_t		*mpt;
	uint32_t		new_rkey;

	/* Check for a valid Memory Window handle in the WR */
	mw = (mcxnex_mwhdl_t)wr->wr.rc.rcwr.bind->bind_ibt_mw_hdl;
	if (mw == NULL) {
		return (IBT_MW_HDL_INVALID);
	}

	/* Check for a valid Memory Region handle in the WR */
	mr = (mcxnex_mrhdl_t)wr->wr.rc.rcwr.bind->bind_ibt_mr_hdl;
	if (mr == NULL) {
		return (IBT_MR_HDL_INVALID);
	}

	mutex_enter(&mr->mr_lock);
	mutex_enter(&mw->mr_lock);

	/*
	 * Check here to see if the memory region has already been partially
	 * deregistered as a result of a mcxnex_umap_umemlock_cb() callback.
	 * If so, this is an error, return failure.
	 */
	if ((mr->mr_is_umem) && (mr->mr_umemcookie == NULL)) {
		mutex_exit(&mr->mr_lock);
		mutex_exit(&mw->mr_lock);
		return (IBT_MR_HDL_INVALID);
	}

	/* Check for a valid Memory Window RKey (i.e. a matching RKey) */
	if (mw->mr_rkey != wr->wr.rc.rcwr.bind->bind_rkey) {
		mutex_exit(&mr->mr_lock);
		mutex_exit(&mw->mr_lock);
		return (IBT_MR_RKEY_INVALID);
	}

	/* Check for a valid Memory Region LKey (i.e. a matching LKey) */
	if (mr->mr_lkey != wr->wr.rc.rcwr.bind->bind_lkey) {
		mutex_exit(&mr->mr_lock);
		mutex_exit(&mw->mr_lock);
		return (IBT_MR_LKEY_INVALID);
	}

	/*
	 * Now check for valid "vaddr" and "len".  Note:  We don't check the
	 * "vaddr" range when "len == 0" (i.e. on unbind operations)
	 */
	len = wr->wr.rc.rcwr.bind->bind_len;
	if (len != 0) {
		vaddr = wr->wr.rc.rcwr.bind->bind_va;
		reg_start_addr = mr->mr_bindinfo.bi_addr;
		reg_end_addr   = mr->mr_bindinfo.bi_addr +
		    (mr->mr_bindinfo.bi_len - 1);
		if ((vaddr < reg_start_addr) || (vaddr > reg_end_addr)) {
			mutex_exit(&mr->mr_lock);
			mutex_exit(&mw->mr_lock);
			return (IBT_MR_VA_INVALID);
		}
		vaddr = (vaddr + len) - 1;
		if (vaddr > reg_end_addr) {
			mutex_exit(&mr->mr_lock);
			mutex_exit(&mw->mr_lock);
			return (IBT_MR_LEN_INVALID);
		}
	}

	/*
	 * Validate the bind access flags.  Remote Write and Atomic access for
	 * the Memory Window require that Local Write access be set in the
	 * corresponding Memory Region.
	 */
	bind_flags = wr->wr.rc.rcwr.bind->bind_flags;
	if (((bind_flags & IBT_WR_BIND_WRITE) ||
	    (bind_flags & IBT_WR_BIND_ATOMIC)) &&
	    !(mr->mr_accflag & IBT_MR_LOCAL_WRITE)) {
		mutex_exit(&mr->mr_lock);
		mutex_exit(&mw->mr_lock);
		return (IBT_MR_ACCESS_REQ_INVALID);
	}

	/* Calculate the new RKey for the Memory Window */
	mpt = mw->mr_mptrsrcp;
	new_rkey = mcxnex_mr_keycalc(mpt->hr_indx);
	new_rkey = mcxnex_mr_key_swap(new_rkey);

	wr->wr.rc.rcwr.bind->bind_rkey_out = new_rkey;
	mw->mr_rkey = new_rkey;

	mutex_exit(&mr->mr_lock);
	mutex_exit(&mw->mr_lock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_wrid_from_reset_handling()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_wrid_from_reset_handling(mcxnex_state_t *state, mcxnex_qphdl_t qp)
{
	mcxnex_workq_hdr_t	*swq, *rwq;
	uint_t			qp_srq_en;

	if (qp->qp_is_umap)
		return (DDI_SUCCESS);

	/* grab the cq lock(s) to modify the wqavl tree */
	mutex_enter(&qp->qp_rq_cqhdl->cq_lock);
#ifdef __lock_lint
	mutex_enter(&qp->qp_sq_cqhdl->cq_lock);
#else
	if (qp->qp_rq_cqhdl != qp->qp_sq_cqhdl)
		mutex_enter(&qp->qp_sq_cqhdl->cq_lock);
#endif

	/* Chain the newly allocated work queue header to the CQ's list */
	mcxnex_cq_workq_add(qp->qp_sq_cqhdl, &qp->qp_sq_wqavl);

	swq = qp->qp_sq_wqhdr;
	swq->wq_head = 0;
	swq->wq_tail = 0;
	swq->wq_full = 0;

	/*
	 * Now we repeat all the above operations for the receive work queue,
	 * or shared receive work queue.
	 *
	 * Note: We still use the 'qp_rq_cqhdl' even in the SRQ case.
	 */
	qp_srq_en = qp->qp_srq_en;

#ifdef __lock_lint
	mutex_enter(&qp->qp_srqhdl->srq_lock);
#else
	if (qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mutex_enter(&qp->qp_srqhdl->srq_lock);
	} else {
		rwq = qp->qp_rq_wqhdr;
		rwq->wq_head = 0;
		rwq->wq_tail = 0;
		rwq->wq_full = 0;
		qp->qp_rq_wqecntr = 0;
	}
#endif
	mcxnex_cq_workq_add(qp->qp_rq_cqhdl, &qp->qp_rq_wqavl);

#ifdef __lock_lint
	mutex_exit(&qp->qp_srqhdl->srq_lock);
#else
	if (qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mutex_exit(&qp->qp_srqhdl->srq_lock);
	}
#endif

#ifdef __lock_lint
	mutex_exit(&qp->qp_sq_cqhdl->cq_lock);
#else
	if (qp->qp_rq_cqhdl != qp->qp_sq_cqhdl)
		mutex_exit(&qp->qp_sq_cqhdl->cq_lock);
#endif
	mutex_exit(&qp->qp_rq_cqhdl->cq_lock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_wrid_to_reset_handling()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_wrid_to_reset_handling(mcxnex_state_t *state, mcxnex_qphdl_t qp)
{
	uint_t			qp_srq_en;

	if (qp->qp_is_umap)
		return (DDI_SUCCESS);

	/*
	 * If there are unpolled entries in these CQs, they are
	 * polled/flushed.
	 * Grab the CQ lock(s) before manipulating the lists.
	 */
	mutex_enter(&qp->qp_rq_cqhdl->cq_lock);
#ifdef __lock_lint
	mutex_enter(&qp->qp_sq_cqhdl->cq_lock);
#else
	if (qp->qp_rq_cqhdl != qp->qp_sq_cqhdl)
		mutex_enter(&qp->qp_sq_cqhdl->cq_lock);
#endif

	qp_srq_en = qp->qp_srq_en;
#ifdef __lock_lint
	mutex_enter(&qp->qp_srqhdl->srq_lock);
#else
	if (qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mutex_enter(&qp->qp_srqhdl->srq_lock);
	}
#endif
	/*
	 * Flush the entries on the CQ for this QP's QPN.
	 */
	mcxnex_cq_entries_flush(state, qp);

#ifdef __lock_lint
	mutex_exit(&qp->qp_srqhdl->srq_lock);
#else
	if (qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mutex_exit(&qp->qp_srqhdl->srq_lock);
	}
#endif

	mcxnex_cq_workq_remove(qp->qp_rq_cqhdl, &qp->qp_rq_wqavl);
	mcxnex_cq_workq_remove(qp->qp_sq_cqhdl, &qp->qp_sq_wqavl);

#ifdef __lock_lint
	mutex_exit(&qp->qp_sq_cqhdl->cq_lock);
#else
	if (qp->qp_rq_cqhdl != qp->qp_sq_cqhdl)
		mutex_exit(&qp->qp_sq_cqhdl->cq_lock);
#endif
	mutex_exit(&qp->qp_rq_cqhdl->cq_lock);

	return (IBT_SUCCESS);
}


