Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_wr.c
/*
 * mcxnex_wrid_get_entry()
 *    Context: Can be called from interrupt or base context.
 */
uint64_t
mcxnex_wrid_get_entry(mcxnex_cqhdl_t cq, mcxnex_hw_cqe_t *cqe)
{
	mcxnex_workq_avl_t	*wqa;
	mcxnex_workq_hdr_t	*wq;
	uint64_t		wrid;
	uint_t			send_or_recv, qpnum;
	uint32_t		indx;

	/*
	 * Determine whether this CQE is a send or receive completion.
	 */
	send_or_recv = MCXNEX_CQE_SENDRECV_GET(cq, cqe);

	/* Find the work queue for this QP number (send or receive side) */
	qpnum = MCXNEX_CQE_QPNUM_GET(cq, cqe);
	wqa = mcxnex_wrid_wqavl_find(cq, qpnum, send_or_recv);
	wq = wqa->wqa_wq;

	/*
	 * Regardless of whether the completion is the result of a "success"
	 * or a "failure", we lock the list of "containers" and attempt to
	 * search for the the first matching completion (i.e. the first WR
	 * with a matching WQE addr and size).  Once we find it, we pull out
	 * the "wrid" field and return it (see below).  XXX Note: One possible
	 * future enhancement would be to enable this routine to skip over
	 * any "unsignaled" completions to go directly to the next "signaled"
	 * entry on success.
	 */
	indx = MCXNEX_CQE_WQEADDRSZ_GET(cq, cqe) & wq->wq_mask;
	wrid = wq->wq_wrid[indx];
	if (wqa->wqa_srq_en) {
		struct mcxnex_sw_srq_s	*srq;
		uint64_t		*desc;

		/* put wqe back on the srq free list */
		srq = wqa->wqa_srq;
		mutex_enter(&srq->srq_lock);
		desc = MCXNEX_SRQ_WQE_ADDR(srq, wq->wq_tail);
		((uint16_t *)desc)[1] = htons(indx);
		wq->wq_tail = indx;
		mutex_exit(&srq->srq_lock);
	} else {
		wq->wq_head = (indx + 1) & wq->wq_mask;
		wq->wq_full = 0;
	}

	return (wrid);
}


int
mcxnex_wrid_workq_compare(const void *p1, const void *p2)
{
	mcxnex_workq_compare_t	*cmpp;
	mcxnex_workq_avl_t	*curr;

	cmpp = (mcxnex_workq_compare_t *)p1;
	curr = (mcxnex_workq_avl_t *)p2;

	if (cmpp->cmp_qpn < curr->wqa_qpn)
		return (-1);
	else if (cmpp->cmp_qpn > curr->wqa_qpn)
		return (+1);
	else if (cmpp->cmp_type < curr->wqa_type)
		return (-1);
	else if (cmpp->cmp_type > curr->wqa_type)
		return (+1);
	else
		return (0);
}


/*
 * mcxnex_wrid_workq_find()
 *    Context: Can be called from interrupt or base context.
 */
static mcxnex_workq_avl_t *
mcxnex_wrid_wqavl_find(mcxnex_cqhdl_t cq, uint_t qpn, uint_t wq_type)
{
	mcxnex_workq_avl_t	*curr;
	mcxnex_workq_compare_t	cmp;

	/*
	 * Walk the CQ's work queue list, trying to find a send or recv queue
	 * with the same QP number.  We do this even if we are going to later
	 * create a new entry because it helps us easily find the end of the
	 * list.
	 */
	cmp.cmp_qpn = qpn;
	cmp.cmp_type = wq_type;
#ifdef __lock_lint
	mcxnex_wrid_workq_compare(NULL, NULL);
#endif
	curr = avl_find(&cq->cq_wrid_wqhdr_avl_tree, &cmp, NULL);

	return (curr);
}


/*
 * mcxnex_wrid_wqhdr_create()
 *    Context: Can be called from base context.
 */
/* ARGSUSED */
mcxnex_workq_hdr_t *
mcxnex_wrid_wqhdr_create(int bufsz)
{
	mcxnex_workq_hdr_t	*wqhdr;

	/*
	 * Allocate space for the wqhdr, and an array to record all the wrids.
	 */
	wqhdr = (mcxnex_workq_hdr_t *)kmem_zalloc(sizeof (*wqhdr), KM_NOSLEEP);
	if (wqhdr == NULL) {
		return (NULL);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*wqhdr))
	wqhdr->wq_wrid = kmem_zalloc(bufsz * sizeof (uint64_t), KM_NOSLEEP);
	if (wqhdr->wq_wrid == NULL) {
		kmem_free(wqhdr, sizeof (*wqhdr));
		return (NULL);
	}
	wqhdr->wq_size = bufsz;
	wqhdr->wq_mask = bufsz - 1;

	return (wqhdr);
}

void
mcxnex_wrid_wqhdr_destroy(mcxnex_workq_hdr_t *wqhdr)
{
	kmem_free(wqhdr->wq_wrid, wqhdr->wq_size * sizeof (uint64_t));
	kmem_free(wqhdr, sizeof (*wqhdr));
}


/*
 * mcxnex_cq_workq_add()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_cq_workq_add(mcxnex_cqhdl_t cq, mcxnex_workq_avl_t *wqavl)
{
	mcxnex_workq_compare_t	cmp;
	avl_index_t		where;

	cmp.cmp_qpn = wqavl->wqa_qpn;
	cmp.cmp_type = wqavl->wqa_type;
#ifdef __lock_lint
	mcxnex_wrid_workq_compare(NULL, NULL);
#endif
	(void) avl_find(&cq->cq_wrid_wqhdr_avl_tree, &cmp, &where);
	avl_insert(&cq->cq_wrid_wqhdr_avl_tree, wqavl, where);
}


/*
 * mcxnex_cq_workq_remove()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_cq_workq_remove(mcxnex_cqhdl_t cq, mcxnex_workq_avl_t *wqavl)
{
#ifdef __lock_lint
	mcxnex_wrid_workq_compare(NULL, NULL);
#endif
	avl_remove(&cq->cq_wrid_wqhdr_avl_tree, wqavl);
}
